In [2]:
import pandas as pd
import matplotlib.pyplot as mp
import seaborn as sns

In [3]:
df = pd.read_csv('data.csv')

In [4]:
df.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [5]:
df["parental level of education"].value_counts()/10
## porcentagens de cada nível de educação dos pais

parental level of education
some college          22.6
associate's degree    22.2
high school           19.6
some high school      17.9
bachelor's degree     11.8
master's degree        5.9
Name: count, dtype: float64

In [6]:
df.groupby("parental level of education")["math score"].mean()
## média da pontuação em matemática por nível de educação dos pais

parental level of education
associate's degree    67.882883
bachelor's degree     69.389831
high school           62.137755
master's degree       69.745763
some college          67.128319
some high school      63.497207
Name: math score, dtype: float64

In [7]:
df.groupby("parental level of education")[["math score", "writing score", "reading score"]].mean()/10
## média das pontuações em matemática, escrita e leitura por nível de educação dos pais

                             math score  writing score  reading score
parental level of education
associate's degree             6.788288       6.989640       7.092793
bachelor's degree              6.938983       7.338136       7.300000
high school                    6.213776       6.244898       6.470408
master's degree                6.974576       7.567797       7.537288
some college                   6.712832       6.884071       6.946018
some high school               6.349721       6.488827       6.693855

In [8]:
df.groupby(["parental level of education","race/ethnicity"])[["math score", "writing score", "reading score"]].mean()
## média das pontuações em matemática, escrita e leitura por nível de educação dos pais e raça/etnia

                                            math score  writing score  \
parental level of education race/ethnicity
associate's degree          group A          61.000000      63.571429
                            group B          66.097561      68.243902
                            group C          66.730769      70.269231
                            group D          67.600000      69.860000
                            group E          74.897436      73.205128
bachelor's degree           group A          67.166667      68.333333
                            group B          69.300000      71.650000
                            group C          68.150000      75.900000
                            group D          67.571429      71.892857
                            group E          76.555556      75.388889
high school                 group A          60.444444      60.500000
                            group B          59.791667      61.250000
                            group C          60.906250      61.656250
                            group D          62.863636      63.159091
                            group E          70.772727      67.545455
master's degree             group A          57.666667      67.666667
                            group B          67.166667      77.166667
                            group C          67.052632      69.526316
                            group D          72.521739      79.739130
                            group E          74.625000      80.500000
some college                group A          63.888889      65.000000
                            group B          63.189189      64.189189
                            group C          65.130435      68.869565
                            group D          68.731343      71.701493
                            group E          73.828571      70.200000
some high school            group A          58.916667      58.583333
                            group B          61.815789      64.605263
                            group C          60.551020      63.285714
                            group D          66.760000      69.100000
                            group E          72.111111      66.555556

                                            reading score
parental level of education race/ethnicity
associate's degree          group A             67.071429
                            group B             69.585366
                            group C             71.128205
                            group D             70.540000
                            group E             73.820513
bachelor's degree           group A             68.083333
                            group B             72.950000
                            group C             75.675000
                            group D             70.142857
                            group E             74.833333
high school                 group A             62.888889
                            group B             63.458333
                            group C             64.421875
                            group D             64.409091
                            group E             70.318182
master's degree             group A             64.666667
                            group B             80.166667
                            group C             70.526316
                            group D             77.173913
                            group E             82.125000
some college                group A             65.777778
                            group B             65.756757
                            group C             69.420290
                            group D             70.880597
                            group E             72.628571
some high school            group A             62.083333
                            group B             66.447368
                            group C             65.632653
                            group D             69.980000
                            group E             69.555556

In [9]:
df["gender"].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

In [10]:
# Normalização por proporção (percentuais)
proporcoes_genero = df["gender"].value_counts(normalize=True) * 100
print("Proporções em %:")
print(proporcoes_genero)

# Ou usar value_counts diretamente
print("\nProporções (0-1):")
print(df["gender"].value_counts(normalize=True))

Proporções em %:
gender
female    51.8
male      48.2
Name: proportion, dtype: float64

Proporções (0-1):
gender
female    0.518
male      0.482
Name: proportion, dtype: float64

In [13]:
##MEDIA DE MATEMÁTICA POR GENERO

df.groupby("gender")["math score"].mean().reset_index()

   gender  math score
0  female   63.633205
1    male   68.728216

In [14]:
#MEDIA POR GRUPO ETNICO

df.groupby("race/ethnicity")["math score"].mean().reset_index()

  race/ethnicity  math score
0        group A   61.629213
1        group B   63.452632
2        group C   64.463950
3        group D   67.362595
4        group E   73.821429

In [15]:
df.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [17]:
#impacto do curso preparatorio

df.groupby("test preparation course")[["math score","reading score","writing score"]].mean().reset_index()

  test preparation course  math score  reading score  writing score
0               completed   69.695531      73.893855      74.418994
1                    none   64.077882      66.534268      64.504673

In [21]:
#agrupamento por 2 colunas

df.groupby(["gender","test preparation course"])["math score"].mean().reset_index()

   gender test preparation course  math score
0  female               completed   67.195652
1  female                    none   61.670659
2    male               completed   72.339080
3    male                    none   66.688312

In [22]:
#varias estatísticas

df.groupby(["gender","test preparation course"])["math score"].agg(["mean","std","min","max"]).reset_index()

   gender test preparation course       mean        std  min  max
0  female               completed  67.195652  14.244346   23   99
1  female                    none  61.670659  15.818013    0  100
2    male               completed  72.339080  14.221817   39  100
3    male                    none  66.688312  14.049016   27   97

In [26]:
df.groupby("gender")[["math score","reading score","writing score"]].min().reset_index()

   gender  math score  reading score  writing score
0  female           0             17             10
1    male          27             23             15